---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCGenericRevitImportWarning
source: html/10ead511-26d4-29f2-6c73-3ba590583701.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCGenericRevitImportWarning Property

Revit had the following problems importing the IFC file: [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId IFCGenericRevitImportWarning { get; }
```